{
  "visual": {
    "navbar": {
      "links": [
        {
          "label": "Experience",
          "path": "#experience"
        },
        {
          "label": "Projects",
          "path": "#projects"
        },
        {
          "label": "Education",
          "path": "#education"
        }
      ]
    },
    "home": {
      "sections": {
        "banner": true,
        "experience": true,
        "project": true,
        "education": true
      }
    }
  },
  "personalInfo": {
    "name": "Nihar Lodaya",
    "title": "Software Developer",
    "location": "New York",
    "bio": [
      "Cloud-native, ML-curious, full-stack builder who can’t resist a good side project. Most days you’ll catch me architecting resilient Java/Spring microservices and polishing React front-ends so users never feel the plumbing underneath.",
      "I love turning rough ideas into reliable, scalable software—shipped fast, tested well, and ready to evolve. If something breaks, I fix it, document it, and share the lesson.",
      "Away from the keyboard, you’ll find me reading, buried in movies or hunting for the perfect espresso.",
      "Got an idea that needs scalable backends, machine-learning smarts, or just an extra set of curious eyes? Let’s connect and build something great together."
    ]
  },
  "contactInfo": {
    "email": "niharlodaya7@gmail.com",
    "phone": "+1 347-494-9434",
    "linkedin": "https://www.linkedin.com/in/niharlodaya",
    "github": "https://github.com/niharl7"
  },
  "skills": {
    "languages": ["Java", "Python", "C++", "JavaScript", "HTML", "CSS"],
    "frameworks": [
      "Spring boot",
      "ReactJS",
      "NextJS",
      "NodeJS",
      "TensorFlow",
      "Flask"
    ],
    "databases": ["MySQL", "MongoDB", "PostgreSQL"],
    "tools": ["AWS", "Docker", "Postman", "Git", "Azure"]
  },
  "projects": [
    {
      "id": "1",
      "title": "Emotune: Audio Emotion Analyzer",
      "description": "• Trained a 1D-CNN on the RAVDESS dataset (2,440 audio clips across 8 emotions), extracting 40 MFCC features per sample\n• Achieved 94.8% accuracy and 0.95 macro F1-score on the test set after 50 epochs, reducing preprocessing time by 20% through optimized pipelines\n• Implemented dropout (0.2) and max-pooling layers to prevent overfitting, boosting minority-class F1 by 12%\n• Visualized performance with confusion matrix and classification report, ensuring > 90% recall across all emotion classes",
      "technologies": [
        "Python 3",
        "TensorFlow 2 / Keras",
        "Librosa",
        "scikit-learn",
        "Matplotlib",
        "Pandas",
        "Google Colab",
        "Jupyter Notebook"
      ],
      "live_url": "https://colab.research.google.com/drive/1QXXU1YbXCO88pFbTMRvWO19tuFE1IF3S?usp=sharing",
      "cover": "/assets/project_1.jpeg"
    },
    {
      "id": "2",
      "title": "The Hero’s Journey – 2D Action-Adventure Game",
      "description": "• Built a 4-level Processing side-scroller in 3 months with platforming, upgrades, and a final boss\n• Crafted varied levels (forest, cave, castle, village) to boost player immersion\n• Added checkpoints and story cards, cutting restarts by 30% and maintaining a stable 60 FPS on Mac and Windows\n• Authored design docs and QA reports to streamline collaboration",
      "technologies": ["Java", "Processing", "Git", "Tiled Map Editor"],
      "live_url": "",
      "cover": "/assets/project_2.jpeg"
    },
    {
      "id": "3",
      "title": "Getaway – Hotel-Booking Web App",
      "description": "• Independently developed an online hotel-booking platform in three weeks\n• Leveraged Next.js, React, Redux, Express, Node.js, MongoDB, Cloudinary, and Stripe; deployed on Vercel\n• Delivered intuitive navigation, secure Stripe-integrated payments, and efficient MongoDB data management",
      "technologies": [
        "Next.js",
        "React.js",
        "Redux",
        "Node.js",
        "Express.js",
        "MongoDB",
        "Cloudinary",
        "Stripe",
        "Vercel"
      ],
      "live_url": "https://getaway.vercel.app",
      "cover": "/assets/project_3.jpeg"
    },
    {
      "id": "4",
      "title": "JavaMovieDatabaseApp",
      "description": "• Created a full-stack movie management platform, building a Java Spring Boot RESTful API backend connected to a JavaFX user interface\n• Implemented critical functionalities like user authentication (session-based), CRUD operations for movie listings, user-generated reviews, and role-defined access (Admin/User)\n• Employed Spring Data JPA for MySQL data persistence within an MVC structure and established robust security protocols with Spring Security",
      "technologies": [
        "Java",
        "Spring Boot",
        "Spring Security",
        "Spring Data JPA",
        "MySQL",
        "JavaFX",
        "MVC",
        "REST API"
      ],
      "code_repo_url": "https://github.com/Niharl7/JavaMovieDatabaseApp",
      "cover": "/assets/project_4.jpeg"
    }    
  ],

  "workExperience": [
    {
      "id": "1",
      "company": "Aurionpro",
      "role": "Software Engineer",
      "startDate": "May 2022",
      "endDate": "Aug 2023",
      "technologies": [
        "Java",
        "Spring Boot",
        "Docker",
        "AWS",
        "Azure",
        "GitLab CI",
        "SQL",
        "JUnit",
        "Mockito"
      ],
      "keyResponsibilities": [
        "Engineered and maintained enterprise-grade Java/Spring Boot applications and RESTful APIs, enabling secure processing of ~400K daily transactions with session management and real-time socket modules",
        "Designed and deployed 12+ containerized microservices on AWS and Oracle Cloud using Docker, Kubernetes, and Helm, accelerating delivery by 40% through CI/CD pipelines built in Jenkins.",
        "Partnered with cross-functional Agile teams to ship 30+ features with a 95% on-time release rate, leading sprint planning, backlog grooming, and release coordination across environments",
        "Refactored backend architecture and optimized SQL/NoSQL queries, improving average API response times by 35%, cutting production issues by 40%, and enhancing autoscaling during traffic spikes.",
        "Integrated monitoring and alerting with Prometheus, Grafana, and ELK stack to reduce mean time to detect (MTTD) and downtime by 25%, streamlining debugging with custom dashboards.",
        "Collaborated with security and DevOps teams to implement SSO-based authentication, RBAC, and encryption protocols, ensuring end-to-end compliance with enterprise data protection standards."
      ]
    }
  ],

  "education": [
    {
      "id": "1",
      "institution": "Marist University",
      "degree": "Master of Science in Computer Science (Software Development)",
      "description": "Graduate program emphasizing cloud-native software development, AI/ML, and scalable microservices. Relevant coursework: Artificial Intelligence, Cloud Computing, Data structures and Algorithms. Current GPA: 3.63.",
      "startDate": "Aug 2023",
      "endDate": "May 2025"
    },
    {
      "id": "2",
      "institution": "Mumbai University",
      "degree": "Bachelor of Science in Computer Science",
      "description": "Completed foundational curriculum covering data structures, algorithms, database management, and software engineering. Led capstone project on mobile-first e-commerce platform.",
      "startDate": "Jul 2019",
      "endDate": "May 2022"
    }
  ]
}
